package cn.yhm.developer.kuca.common.constant;

/**
 * 时间日期时间格式
 *
 * @author victor2015yhm@gmail.com
 * @since 2023-03-24 20:35:11
 */
public interface DateTimeFormatStandard {

    /**
     * 24小时制 "年-月-日 时:分:秒"
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39 【表示 2022年9月4日10点6分39秒】
     */
    String STANDARD_1 = "yyyy-MM-dd HH:mm:ss";

    /**
     * 24小时制 "年-月-日 时:分:秒.毫秒"
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39.56 【表示 2022年9月4日10点6分39秒56毫秒】
     */
    String STANDARD_2 = "yyyy-MM-dd HH:mm:ss.SSS";

    /**
     * 24小时制 "年-月-日 时:分:秒 时区"
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39 +08:00 【表示 东八区 2022年9月4日10点6分39秒】
     * <p>
     * 2022-09-04 10:06:39 Z      【表示 零时区 2022年9月4日10点6分39秒】
     */
    String STANDARD_3 = "yyyy-MM-dd HH:mm:ss XXX";

    /**
     * 24小时制 "年-月-日 时:分:秒.毫秒 时区"
     * <p>
     * 推荐：默认使用
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39.123 +08:00 【表示 东八区 2022年9月4日10点6分39秒123毫秒】
     * <p>
     * 2022-09-04 10:06:39.123 Z      【表示 零时区 2022年9月4日10点6分39秒123毫秒】
     * <p>
     * 2022-09-04 10:06:39.123 -06:00 【表示 西六区 2022年9月4日10点6分39秒123毫秒】
     */
    String STANDARD_4 = "yyyy-MM-dd HH:mm:ss.SSS XXX";

    /**
     * 24小时制 "年-月-日 时:分:秒.微秒 时区"
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39.123250 +08:00 【表示 东八区 2022年9月4日10点6分39秒123250微秒】
     * <p>
     * 2022-09-04 10:06:39.123 Z         【表示 零时区 2022年9月4日10点6分39秒123250微秒】
     * <p>
     * 2022-09-04 10:06:39.123250 -06:00 【表示 西六区 2022年9月4日10点6分39秒123250微秒】
     */
    String STANDARD_5 = "yyyy-MM-dd HH:mm:ss.SSSSSS XXX";

    /**
     * 24小时制 "年-月-日 时:分:秒.纳秒 时区"
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39.123250235 +08:00 【表示 东八区 2022年9月4日10点6分39秒123250235纳秒】
     * <p>
     * 2022-09-04 10:06:39.123250235 Z      【表示 零时区 2022年9月4日10点6分39秒123250235纳秒】
     * <p>
     * 2022-09-04 10:06:39.123250235 -06:00 【表示 西六区 2022年9月4日10点6分39秒123250235纳秒】
     */
    String STANDARD_6 = "yyyy-MM-dd HH:mm:ss.SSSSSSSSS XXX";

    /**
     * 年-月-日
     */
    String STANDARD_7 = "yyyy-MM-dd";

    /**
     * 年/月/日
     */
    String STANDARD_8 = "yyyy/MM/dd";

    /**
     * 24小时制 "时:分:秒"
     */
    String STANDARD_9 = "HH:mm:ss";

    /**
     * 24小时制 "时:分:秒.毫秒"
     */
    String STANDARD_10 = "HH:mm:ss.SSS";

    /**
     * 24小时制 "年-月-日 时:分:秒.毫秒 时区"
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39.123 +08:00 【表示 东八区 2022年9月4日10点6分39秒123毫秒】
     * <p>
     * 2022-09-04 10:06:39.123 +00:00 【表示 零时区 2022年9月4日10点6分39秒123毫秒】
     * <p>
     * 2022-09-04 10:06:39.123 -06:00 【表示 西六区 2022年9月4日10点6分39秒123毫秒】
     */
    String STANDARD_11 = "yyyy-MM-dd HH:mm:ss.SSS xxx";

    /**
     * 24小时制 "年-月-日 时:分:秒.纳秒"
     * <p>
     * 格式：
     * <p>
     * 2022-09-04 10:06:39.123250235 【表示 2022年9月4日10点6分39秒123250235纳秒】
     */
    String STANDARD_12 = "yyyy-MM-dd HH:mm:ss.SSSSSSSSS";
}
